{"do_lower_case": true, "unk_token": "[UNK]", "sep_token": "[SEP]", "pad_token": "[PAD]", "cls_token": "[CLS]", "mask_token": "[MASK]", "tokenize_chinese_chars": true, "strip_accents": null, "special_tokens_map_file": "C:\\Users\\ELECTROBOT/.cache\\huggingface\\transformers\\89f23414b21e26854b3f1a1998ef26b6484a2c196085b8df9fe491a1ade227b8.dd8bd9bfd3664b530ea4e645105f557769387b3da9f79bdb55ed556bdd80611d", "name_or_path": "sentence-transformers/bert-base-nli-mean-tokens", "do_basic_tokenize": true, "never_split": null}